#include <stdio.h>
#include <math.h>
/*
	监护室每小时测量一次病人的血压，若收缩压在90-140之间 并且舒张压在60-90之间(包含端点值)则称之为正常，
	现给出某病人若干次测量的血压值，计算病人保持正常血压的最长小时数。
*/
int main() {
	int n = 0;
	printf("要给某病人测量血压值次数：");
	scanf("%d", &n);

	int h, s, c = 0, p = 0; //h收缩压,s舒张压,p正常次数

	for (int i = 1; i <= n; i++) {
		printf("请输入第 %d 小时测量的 收缩压和舒张压：", i);
		scanf("%d %d", &h, &s);
		if (h >= 90 && h <= 140 && s >= 60 && s <= 90) { // 若收缩压在90-140之间 并且舒张压在60-90之间(包含端点值)则称之为正常
			c++;
			if (c > p) {
				p = c;
			}

		}
	}
	printf("病人保持正常血压的最长 %d 小时", p);

	return 0;
}
